13/data/attachments/98f963a8bcbae462.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ab69a72f-1c6a-4c38-a8c0-fc7218d77eca</nif:username>
            <nif:friendToBeAdded>Michael_finish_Friend_16389_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>